; domain
(define (domain blocksworld-domain)
 (:requirements :adl :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) 
              (ontable ?obj - block) 
              (handempty) 
              (holding ?obj - block)
              (on ?obj1 - block ?obj2 - block)
 )

 (:action pickup
  :parameters (?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and 
            (holding ?obj) 
            (not (clear ?obj)) 
            (not (ontable ?obj)) 
            (not (handempty)) 
          )
 ) 
 (:action pickup-double
  :parameters (?obj - block)
  :precondition (and (ontable ?obj) (handempty) (exists (?topobj - block) (and (on ?topobj ?obj) (clear ?topobj))))
  :effect (and 
            (holding ?obj) 
            (not (ontable ?obj)) 
            (not (handempty)) 
            (and 
                (forall (?topobj - block) 
                    (when (on ?topobj ?obj) 
                          (not(clear ?topobj))
                    )
                )
            )
          )
 )
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and 
            (handempty) 
            (ontable ?obj) 
            (not (holding ?obj)) 
            (forall (?topobj - block) 
                (when (on ?topobj ?obj) 
                      (clear ?topobj)
                )
            )
            (when (not (exists (?topobj - block) (on ?topobj ?obj)))
                (clear ?obj)
            )
           )
 )
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and 
            (handempty) 
            (on ?obj ?underobj) 
            (not (clear ?underobj)) 
            (not (holding ?obj)) 
            (forall (?topobj - block) 
                (when (on ?topobj ?obj) 
                      (clear ?topobj)
                )
            )
            (when (not (exists (?topobj - block) (on ?topobj ?obj)))
                (clear ?obj)
            )
          )
 )
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and 
            (holding ?obj) 
            (clear ?underobj) 
            (not (on ?obj ?underobj)) 
            (not (clear ?obj)) 
            (not (handempty)) 
          )
  )
 (:action unstack-double
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (handempty) (exists (?topobj - block) (and (on ?topobj ?obj) (clear ?topobj))))
  :effect (and 
            (holding ?obj) 
            (clear ?underobj) 
            (not (on ?obj ?underobj)) 
            (not (handempty)) 
            (and 
                (forall (?topobj - block) 
                    (when (on ?topobj ?obj) 
                          (not(clear ?topobj))
                    )
                )
            ) 
          )
 )
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   yellow_block_1 brown_block_1 blue_block_1 grey_block_1 yellow_block_2 - block
 )
 (:init (ontable yellow_block_1) (ontable brown_block_1) (on blue_block_1 brown_block_1) (on grey_block_1 blue_block_1) (on yellow_block_2 grey_block_1) (clear yellow_block_1) (clear yellow_block_2) (handempty) (= (total-cost) 0))
 (:goal (and (on blue_block_1 yellow_block_2)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack yellow_block_2 grey_block_1)
   deleted: (on yellow_block_2 grey_block_1) (clear yellow_block_2) (handempty)
   added: (holding yellow_block_2) (clear grey_block_1)
   goals met: 0 of 1
2. (putdown yellow_block_2)
   deleted: (holding yellow_block_2)
   added: (handempty) (ontable yellow_block_2) (clear yellow_block_2)
   goals met: 0 of 1
3. (unstack grey_block_1 blue_block_1)
   deleted: (on grey_block_1 blue_block_1) (clear grey_block_1) (handempty)
   added: (holding grey_block_1) (clear blue_block_1)
   goals met: 0 of 1
4. (putdown grey_block_1)
   deleted: (holding grey_block_1)
   added: (handempty) (ontable grey_block_1) (clear grey_block_1)
   goals met: 0 of 1
5. (unstack blue_block_1 brown_block_1)
   deleted: (on blue_block_1 brown_block_1) (clear blue_block_1) (handempty)
   added: (holding blue_block_1) (clear brown_block_1)
   goals met: 0 of 1
6. (stack blue_block_1 yellow_block_2)
   deleted: (clear yellow_block_2) (holding blue_block_1)
   added: (handempty) (on blue_block_1 yellow_block_2) (clear blue_block_1)
   goals met: 1 of 1
